[Killed] ObjectLiteral
src/products/product.service.ts:12:49
 
 // Regional margin applied on top of the supplier's base price before VAT.
 // Pulled straight out of the legacy Spring Boot pricing job.
-const REGIONAL_MARGIN: Record<string, number> = {
-  EU: 0.18,
-  UK: 0.22,
-  US: 0.15,
-  APAC: 0.25,
-};
+const REGIONAL_MARGIN: Record<string, number> = {};
 
 const DEFAULT_MARGIN = 0.2;
killedBy: ProductService calculates a reseller price using the regional margin and VAT-on-margin
statusReason: expected 134 to be close to 131.6, received difference is 2.4000000000000057, but expected 0.000005

[Killed] ConditionalExpression
src/products/product.service.ts:26:9
   constructor(private readonly prisma: PrismaService) {}
 
   async create(input: CreateProductInput): Promise<Product> {
-    if (!input.name || input.name.trim().length === 0) {
+    if (true) {
       throw new BadRequestException('name is required');
     }
killedBy: ProductService creates a product when input is valid
statusReason: name is required

[Killed] ConditionalExpression
src/products/product.service.ts:26:9
   constructor(private readonly prisma: PrismaService) {}
 
   async create(input: CreateProductInput): Promise<Product> {
-    if (!input.name || input.name.trim().length === 0) {
+    if (false) {
       throw new BadRequestException('name is required');
     }
killedBy: ProductService rejects products with no name
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/products/product.service.ts:27:37
 
   async create(input: CreateProductInput): Promise<Product> {
     if (!input.name || input.name.trim().length === 0) {
-      throw new BadRequestException('name is required');
+      throw new BadRequestException("");
     }
     if (!input.slug || input.slug.trim().length === 0) {

[Killed] BooleanLiteral
src/products/product.service.ts:29:9
     if (!input.name || input.name.trim().length === 0) {
       throw new BadRequestException('name is required');
     }
-    if (!input.slug || input.slug.trim().length === 0) {
+    if (input.slug || input.slug.trim().length === 0) {
       throw new BadRequestException('slug is required');
     }
killedBy: ProductService creates a product when input is valid
statusReason: slug is required

[Killed] ConditionalExpression
src/products/product.service.ts:29:9
     if (!input.name || input.name.trim().length === 0) {
       throw new BadRequestException('name is required');
     }
-    if (!input.slug || input.slug.trim().length === 0) {
+    if (true) {
       throw new BadRequestException('slug is required');
     }
killedBy: ProductService creates a product when input is valid
statusReason: slug is required

[Killed] ConditionalExpression
src/products/product.service.ts:32:9
     if (!input.slug || input.slug.trim().length === 0) {
       throw new BadRequestException('slug is required');
     }
-    if (input.priceBase == null || input.priceBase <= 0) {
+    if (true) {
       throw new BadRequestException('priceBase must be a positive number');
     }
killedBy: ProductService creates a product when input is valid
statusReason: priceBase must be a positive number

[Killed] EqualityOperator
src/products/product.service.ts:32:9
     if (!input.slug || input.slug.trim().length === 0) {
       throw new BadRequestException('slug is required');
     }
-    if (input.priceBase == null || input.priceBase <= 0) {
+    if (input.priceBase != null || input.priceBase <= 0) {
       throw new BadRequestException('priceBase must be a positive number');
     }
killedBy: ProductService creates a product when input is valid
statusReason: priceBase must be a positive number

[Killed] EqualityOperator
src/products/product.service.ts:35:9
     if (input.priceBase == null || input.priceBase <= 0) {
       throw new BadRequestException('priceBase must be a positive number');
     }
-    if (input.stock == null || input.stock < 0) {
+    if (input.stock != null || input.stock < 0) {
       throw new BadRequestException('stock cannot be negative');
     }
killedBy: ProductService creates a product when input is valid
statusReason: stock cannot be negative

[Killed] EqualityOperator
src/products/product.service.ts:35:32
     if (input.priceBase == null || input.priceBase <= 0) {
       throw new BadRequestException('priceBase must be a positive number');
     }
-    if (input.stock == null || input.stock < 0) {
+    if (input.stock == null || input.stock >= 0) {
       throw new BadRequestException('stock cannot be negative');
     }
killedBy: ProductService creates a product when input is valid
statusReason: stock cannot be negative

[NoCoverage] StringLiteral
src/products/product.service.ts:36:37
       throw new BadRequestException('priceBase must be a positive number');
     }
     if (input.stock == null || input.stock < 0) {
-      throw new BadRequestException('stock cannot be negative');
+      throw new BadRequestException("");
     }
 

[Survived] ObjectLiteral
src/products/product.service.ts:39:39
       throw new BadRequestException('stock cannot be negative');
     }
 
-    return this.prisma.product.create({
-      data: {
-        name: input.name.trim(),
-        slug: input.slug.trim(),
-        priceBase: input.priceBase,
-        priceTax: input.priceTax,
-        priceTaxRate: input.priceTaxRate,
-        discounts: input.discounts ?? [],
-        images: (input.images ?? {}) as Prisma.InputJsonValue,
-        suppliersRegions: (input.suppliersRegions ?? {}) as unknown as Prisma.InputJsonValue,
-        kilos: input.kilos,
-        volume: input.volume,
-        quantity: input.quantity,
-        stock: input.stock,
-        warehouseLocation: input.warehouseLocation,
-        supplierId: input.supplierId,
-      },
-    });
+    return this.prisma.product.create({});
   }
 

[Survived] MethodExpression
src/products/product.service.ts:41:15
 
     return this.prisma.product.create({
       data: {
-        name: input.name.trim(),
+        name: input.name,
         slug: input.slug.trim(),
         priceBase: input.priceBase,

[Survived] MethodExpression
src/products/product.service.ts:42:15
     return this.prisma.product.create({
       data: {
         name: input.name.trim(),
-        slug: input.slug.trim(),
+        slug: input.slug,
         priceBase: input.priceBase,
         priceTax: input.priceTax,

[Survived] LogicalOperator
src/products/product.service.ts:46:20
         priceBase: input.priceBase,
         priceTax: input.priceTax,
         priceTaxRate: input.priceTaxRate,
-        discounts: input.discounts ?? [],
+        discounts: input.discounts && [],
         images: (input.images ?? {}) as Prisma.InputJsonValue,
         suppliersRegions: (input.suppliersRegions ?? {}) as unknown as Prisma.InputJsonValue,

[NoCoverage] BlockStatement
src/products/product.service.ts:59:54
     });
   }
 
-  async findAll(region?: string): Promise<Product[]> {
-    if (!region) {
-      return this.prisma.product.findMany({ orderBy: { createdAt: 'desc' } });
-    }
-    const all = await this.prisma.product.findMany({ orderBy: { createdAt: 'desc' } });
-    return all.filter((p) => Object.keys(p.suppliersRegions as object).includes(region));
-  }
+  async findAll(region?: string): Promise<Product[]> {}
 
   async findOne(id: string): Promise<Product> {

[NoCoverage] BlockStatement
src/products/product.service.ts:60:18
   }
 
   async findAll(region?: string): Promise<Product[]> {
-    if (!region) {
-      return this.prisma.product.findMany({ orderBy: { createdAt: 'desc' } });
-    }
+    if (!region) {}
     const all = await this.prisma.product.findMany({ orderBy: { createdAt: 'desc' } });
     return all.filter((p) => Object.keys(p.suppliersRegions as object).includes(region));

[NoCoverage] BooleanLiteral
src/products/product.service.ts:60:9
   }
 
   async findAll(region?: string): Promise<Product[]> {
-    if (!region) {
+    if (region) {
       return this.prisma.product.findMany({ orderBy: { createdAt: 'desc' } });
     }

[NoCoverage] ArrowFunction
src/products/product.service.ts:64:23
       return this.prisma.product.findMany({ orderBy: { createdAt: 'desc' } });
     }
     const all = await this.prisma.product.findMany({ orderBy: { createdAt: 'desc' } });
-    return all.filter((p) => Object.keys(p.suppliersRegions as object).includes(region));
+    return all.filter(() => undefined);
   }
 

[NoCoverage] MethodExpression
src/products/product.service.ts:64:12
       return this.prisma.product.findMany({ orderBy: { createdAt: 'desc' } });
     }
     const all = await this.prisma.product.findMany({ orderBy: { createdAt: 'desc' } });
-    return all.filter((p) => Object.keys(p.suppliersRegions as object).includes(region));
+    return all;
   }
 

[Killed] BlockStatement
src/products/product.service.ts:67:47
     return all.filter((p) => Object.keys(p.suppliersRegions as object).includes(region));
   }
 
-  async findOne(id: string): Promise<Product> {
-    const product = await this.prisma.product.findUnique({ where: { id } });
-    if (!product) {
-      throw new NotFoundException(`product ${id} not found`);
-    }
-    return product;
-  }
+  async findOne(id: string): Promise<Product> {}
 
   async reserveStock(id: string, quantity: number): Promise<Product> {
killedBy: ProductService throws NotFoundException when the product does not exist
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ObjectLiteral
src/products/product.service.ts:68:58
   }
 
   async findOne(id: string): Promise<Product> {
-    const product = await this.prisma.product.findUnique({ where: { id } });
+    const product = await this.prisma.product.findUnique({});
     if (!product) {
       throw new NotFoundException(`product ${id} not found`);

[Survived] ObjectLiteral
src/products/product.service.ts:68:67
   }
 
   async findOne(id: string): Promise<Product> {
-    const product = await this.prisma.product.findUnique({ where: { id } });
+    const product = await this.prisma.product.findUnique({ where: {} });
     if (!product) {
       throw new NotFoundException(`product ${id} not found`);

[Killed] ConditionalExpression
src/products/product.service.ts:69:9
 
   async findOne(id: string): Promise<Product> {
     const product = await this.prisma.product.findUnique({ where: { id } });
-    if (!product) {
+    if (false) {
       throw new NotFoundException(`product ${id} not found`);
     }
killedBy: ProductService throws NotFoundException when the product does not exist
statusReason: promise resolved "null" instead of rejecting

[Killed] ConditionalExpression
src/products/product.service.ts:69:9
 
   async findOne(id: string): Promise<Product> {
     const product = await this.prisma.product.findUnique({ where: { id } });
-    if (!product) {
+    if (true) {
       throw new NotFoundException(`product ${id} not found`);
     }
killedBy: ProductService throws when reserving more than available stock
statusReason: expected NotFoundException: product 1 not found { …(3) } to be an instance of BadRequestException

[Killed] BlockStatement
src/products/product.service.ts:75:70
     return product;
   }
 
-  async reserveStock(id: string, quantity: number): Promise<Product> {
-    if (!quantity || quantity <= 0) {
-      throw new BadRequestException('quantity must be a positive number');
-    }
-
-    const product = await this.findOne(id);
-
-    if (product.stock < quantity) {
-      throw new BadRequestException('not enough stock to reserve');
-    }
-
-    return this.prisma.product.update({
-      where: { id },
-      data: { stock: product.stock - quantity },
-    });
-  }
+  async reserveStock(id: string, quantity: number): Promise<Product> {}
 
   // Mixes supplier base price, a regional margin, and VAT charged on top of
killedBy: ProductService throws when reserving more than available stock
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/products/product.service.ts:76:22
   }
 
   async reserveStock(id: string, quantity: number): Promise<Product> {
-    if (!quantity || quantity <= 0) {
+    if (!quantity || quantity > 0) {
       throw new BadRequestException('quantity must be a positive number');
     }
killedBy: ProductService reserves stock by decrementing the quantity
statusReason: quantity must be a positive number

[Killed] BooleanLiteral
src/products/product.service.ts:76:9
   }
 
   async reserveStock(id: string, quantity: number): Promise<Product> {
-    if (!quantity || quantity <= 0) {
+    if (quantity || quantity <= 0) {
       throw new BadRequestException('quantity must be a positive number');
     }
killedBy: ProductService reserves stock by decrementing the quantity
statusReason: quantity must be a positive number

[Killed] ConditionalExpression
src/products/product.service.ts:82:9
 
     const product = await this.findOne(id);
 
-    if (product.stock < quantity) {
+    if (false) {
       throw new BadRequestException('not enough stock to reserve');
     }
killedBy: ProductService throws when reserving more than available stock
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/products/product.service.ts:82:9
 
     const product = await this.findOne(id);
 
-    if (product.stock < quantity) {
+    if (true) {
       throw new BadRequestException('not enough stock to reserve');
     }
killedBy: ProductService reserves stock by decrementing the quantity
statusReason: not enough stock to reserve

[Survived] StringLiteral
src/products/product.service.ts:83:37
     const product = await this.findOne(id);
 
     if (product.stock < quantity) {
-      throw new BadRequestException('not enough stock to reserve');
+      throw new BadRequestException("");
     }
 

[Killed] ArithmeticOperator
src/products/product.service.ts:88:22
 
     return this.prisma.product.update({
       where: { id },
-      data: { stock: product.stock - quantity },
+      data: { stock: product.stock + quantity },
     });
   }
killedBy: ProductService reserves stock by decrementing the quantity
statusReason: expected "spy" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
src/products/product.service.ts:95:77
   // Mixes supplier base price, a regional margin, and VAT charged on top of
   // that margin into a single number. This kind of pricing rule is exactly
   // what belongs on a domain object instead of buried in a service method.
-  async calculateResellerPrice(id: string, region: string): Promise<number> {
-    const product = await this.findOne(id);
-
-    const margin = REGIONAL_MARGIN[region] ?? DEFAULT_MARGIN;
-    const marginAmount = product.priceBase * margin;
-    const vatOnMargin = marginAmount * product.priceTaxRate;
-
-    const resellerPrice = product.priceBase + marginAmount + product.priceTax + vatOnMargin;
-
-    return Math.round(resellerPrice * 100) / 100;
-  }
+  async calculateResellerPrice(id: string, region: string): Promise<number> {}
 }
 
killedBy: ProductService calculates a reseller price using the regional margin and VAT-on-margin
statusReason: expected undefined to be close to 131.6, received difference is NaN, but expected 0.000005

[Killed] LogicalOperator
src/products/product.service.ts:98:20
   async calculateResellerPrice(id: string, region: string): Promise<number> {
     const product = await this.findOne(id);
 
-    const margin = REGIONAL_MARGIN[region] ?? DEFAULT_MARGIN;
+    const margin = REGIONAL_MARGIN[region] && DEFAULT_MARGIN;
     const marginAmount = product.priceBase * margin;
     const vatOnMargin = marginAmount * product.priceTaxRate;
killedBy: ProductService calculates a reseller price using the regional margin and VAT-on-margin
statusReason: expected 134 to be close to 131.6, received difference is 2.4000000000000057, but expected 0.000005

[Killed] ArithmeticOperator
src/products/product.service.ts:99:26
     const product = await this.findOne(id);
 
     const margin = REGIONAL_MARGIN[region] ?? DEFAULT_MARGIN;
-    const marginAmount = product.priceBase * margin;
+    const marginAmount = product.priceBase / margin;
     const vatOnMargin = marginAmount * product.priceTaxRate;
 
killedBy: ProductService calculates a reseller price using the regional margin and VAT-on-margin
statusReason: expected 776.67 to be close to 131.6, received difference is 645.0699999999999, but expected 0.000005

[Killed] ArithmeticOperator
src/products/product.service.ts:100:25
 
     const margin = REGIONAL_MARGIN[region] ?? DEFAULT_MARGIN;
     const marginAmount = product.priceBase * margin;
-    const vatOnMargin = marginAmount * product.priceTaxRate;
+    const vatOnMargin = marginAmount / product.priceTaxRate;
 
     const resellerPrice = product.priceBase + marginAmount + product.priceTax + vatOnMargin;
killedBy: ProductService calculates a reseller price using the regional margin and VAT-on-margin
statusReason: expected 218 to be close to 131.6, received difference is 86.4, but expected 0.000005

[Killed] ArithmeticOperator
src/products/product.service.ts:102:27
     const marginAmount = product.priceBase * margin;
     const vatOnMargin = marginAmount * product.priceTaxRate;
 
-    const resellerPrice = product.priceBase + marginAmount + product.priceTax + vatOnMargin;
+    const resellerPrice = product.priceBase + marginAmount - product.priceTax + vatOnMargin;
 
     return Math.round(resellerPrice * 100) / 100;
killedBy: ProductService calculates a reseller price using the regional margin and VAT-on-margin
statusReason: expected 111.6 to be close to 131.6, received difference is 20, but expected 0.000005

[Killed] ArithmeticOperator
src/products/product.service.ts:102:27
     const marginAmount = product.priceBase * margin;
     const vatOnMargin = marginAmount * product.priceTaxRate;
 
-    const resellerPrice = product.priceBase + marginAmount + product.priceTax + vatOnMargin;
+    const resellerPrice = product.priceBase + marginAmount + product.priceTax - vatOnMargin;
 
     return Math.round(resellerPrice * 100) / 100;
killedBy: ProductService calculates a reseller price using the regional margin and VAT-on-margin
statusReason: expected 124.4 to be close to 131.6, received difference is 7.199999999999989, but expected 0.000005

[Killed] ArithmeticOperator
src/products/product.service.ts:104:12
 
     const resellerPrice = product.priceBase + marginAmount + product.priceTax + vatOnMargin;
 
-    return Math.round(resellerPrice * 100) / 100;
+    return Math.round(resellerPrice * 100) * 100;
   }
 }
killedBy: ProductService calculates a reseller price using the regional margin and VAT-on-margin
statusReason: expected 1316000 to be close to 131.6, received difference is 1315868.4, but expected 0.000005

[Killed] ArithmeticOperator
src/products/product.service.ts:104:23
 
     const resellerPrice = product.priceBase + marginAmount + product.priceTax + vatOnMargin;
 
-    return Math.round(resellerPrice * 100) / 100;
+    return Math.round(resellerPrice / 100) / 100;
   }
 }
killedBy: ProductService calculates a reseller price using the regional margin and VAT-on-margin
statusReason: expected 0.01 to be close to 131.6, received difference is 131.59, but expected 0.000005
