[Killed] BlockStatement
src/products/products.controller.ts:20:39
   }
 
   @Post()
-  async create(@Body() body: unknown) {
-    // Naive boundary validation: parse, and turn a failed parse into a 400
-    // the default way. Shape is checked here; nothing downstream knows or
-    // cares whether the numbers inside make business sense.
-    let input;
-    try {
-      input = CreateProductSchema.parse(body);
-    } catch (err) {
-      if (err instanceof ZodError) {
-        throw new BadRequestException(err.issues);
-      }
-      throw err;
-    }
-    return this.productCreator.create(input);
-  }
+  async create(@Body() body: unknown) {}
 
   @Get()
killedBy: ProductsController delegates product creation to the creator interface
statusReason: expected "spy" to be called at least once

[Survived] BlockStatement
src/products/products.controller.ts:25:9
     // the default way. Shape is checked here; nothing downstream knows or
     // cares whether the numbers inside make business sense.
     let input;
-    try {
-      input = CreateProductSchema.parse(body);
-    } catch (err) {
+    try {} catch (err) {
       if (err instanceof ZodError) {
         throw new BadRequestException(err.issues);

[NoCoverage] BlockStatement
src/products/products.controller.ts:27:19
     let input;
     try {
       input = CreateProductSchema.parse(body);
-    } catch (err) {
-      if (err instanceof ZodError) {
-        throw new BadRequestException(err.issues);
-      }
-      throw err;
-    }
+    } catch (err) {}
     return this.productCreator.create(input);
   }

[NoCoverage] ConditionalExpression
src/products/products.controller.ts:28:11
     try {
       input = CreateProductSchema.parse(body);
     } catch (err) {
-      if (err instanceof ZodError) {
+      if (false) {
         throw new BadRequestException(err.issues);
       }

[NoCoverage] BlockStatement
src/products/products.controller.ts:28:36
     try {
       input = CreateProductSchema.parse(body);
     } catch (err) {
-      if (err instanceof ZodError) {
-        throw new BadRequestException(err.issues);
-      }
+      if (err instanceof ZodError) {}
       throw err;
     }

[NoCoverage] CallExpression
src/products/products.controller.ts:29:9
       input = CreateProductSchema.parse(body);
     } catch (err) {
       if (err instanceof ZodError) {
-        throw new BadRequestException(err.issues);
+        ;
       }
       throw err;

[NoCoverage] BlockStatement
src/products/products.controller.ts:37:51
   }
 
   @Get()
-  async findAll(@Query('region') region?: string) {
-    return this.productReader.findAll(region);
-  }
+  async findAll(@Query('region') region?: string) {}
 
   @Get(':id')

[NoCoverage] BlockStatement
src/products/products.controller.ts:42:42
   }
 
   @Get(':id')
-  async findOne(@Param('id') id: string) {
-    return this.productReader.findOne(id);
-  }
+  async findOne(@Param('id') id: string) {}
 
   @Get(':id/reseller-price')

[Killed] BlockStatement
src/products/products.controller.ts:47:81
   }
 
   @Get(':id/reseller-price')
-  async resellerPrice(@Param('id') id: string, @Query('region') region: string) {
-    return {resellerPrice: await this.resellerPriceCalculator.calculateResellerPrice(id, region)};
-  }
+  async resellerPrice(@Param('id') id: string, @Query('region') region: string) {}
 
   @Patch(':id/reserve')
killedBy: ProductsController wraps the reseller price in a response object
statusReason: expected "spy" to be called with arguments: [ '1', 'EU' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/products/products.controller.ts:52:78
   }
 
   @Patch(':id/reserve')
-  async reserve(@Param('id') id: string, @Body('quantity') quantity: number) {
-    return this.stockReserver.reserveStock(id, quantity);
-  }
+  async reserve(@Param('id') id: string, @Body('quantity') quantity: number) {}
 }
 
killedBy: ProductsController delegates reservation to the reserver interface
statusReason: expected "spy" to be called with arguments: [ '1', 4 ]

Received: 



Number of calls: 0
