[Killed] MethodExpression
src/products/create-product.schema.ts:14:9
 //
 // TODO(refactor): shape validation → domain invariants (VO factories / aggregate constructors).
 export const CreateProductSchema = z.object({
-  name: z.string().min(1),
+  name: z.string().max(1),
   slug: z.string().min(1),
 
killedBy: ProductsController delegates product creation to the creator interface
statusReason: Bad Request Exception

[Killed] MethodExpression
src/products/create-product.schema.ts:15:9
 // TODO(refactor): shape validation → domain invariants (VO factories / aggregate constructors).
 export const CreateProductSchema = z.object({
   name: z.string().min(1),
-  slug: z.string().min(1),
+  slug: z.string().max(1),
 
   priceBase: z.number().nonnegative(),
killedBy: ProductsController delegates product creation to the creator interface
statusReason: Bad Request Exception
